In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\91899\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91899\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91899\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\91899\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\91899\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\91899\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

In [4]:
# 1. Data Frame.............................................

In [7]:
arr1 = pd.DataFrame([1,2,3], columns=['Col_num'])
arr1

   Col_num
0        1
1        2
2        3

In [8]:
data = {
  'name': ['Vishal', 'om', 'Shubz'],
   'age':[11,11,11]
}

data = pd.DataFrame(data)
data

     name  age
0  Vishal   11
1      om   11
2   Shubz   11

In [9]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [10]:
 # basic data frame Undestand

In [12]:
data.head(2)

     name  age
0  Vishal   11
1      om   11

In [13]:
data.tail(2)

    name  age
1     om   11
2  Shubz   11

In [15]:
data.shape

(3, 2)

In [16]:
data.columns

Index(['name', 'age'], dtype='object')

In [21]:
data = data.rename(columns={'name':'full_name'})
data

  full_name  age
0    Vishal   11
1        om   11
2     Shubz   11

In [22]:
data

  full_name  age
0    Vishal   11
1        om   11
2     Shubz   11

In [23]:
data.info

<bound method DataFrame.info of   full_name  age
0    Vishal   11
1        om   11
2     Shubz   11>

In [25]:
data.describe()

        age
count   3.0
mean   11.0
std     0.0
min    11.0
25%    11.0
50%    11.0
75%    11.0
max    11.0

In [26]:
# 3. save and Load data from csv:

In [27]:
data

  full_name  age
0    Vishal   11
1        om   11
2     Shubz   11

In [32]:
data.to_csv('Test_data.csv', index=False)

In [33]:
load = pd.read_csv('Test_data.csv')
load

  full_name  age
0    Vishal   11
1        om   33
2     Shubz   55